{
  "id": 6,
  "name": "#6: \"Move Fast and Build Things: A Non-Technical Guide to AI Agents\" by Eric Bye and \"Dark side of the Moon\" by Rehan Butt",
  "description": "TBC",
  "dateStart": "2025-03-27T18:00Z",
  "dateEnd": "2025-03-27T20:00Z",
  "location": "Vulcan Works, 34-38 Guildhall Rd, Northampton, NN1 1EW",
  "locationUrl": "https://maps.app.goo.gl/q7RFeDME5cLZWPFA7",
  "locatoinLatitude": "52.23585",
  "locatoinLongitude": "-0.894449",
  "parking": "St. John's Multi Storey Car Park",
  "parkingUrl": "https://maps.app.goo.gl/fk3jpaPLSLGrHNmH6",
  "schedule": [
    {
      "dateStart": "2025-03-27T18:00Z",
      "dateEnd": "2025-03-27T18:30Z",
      "title": "Meet and Greet"
    },
    {
      "dateStart": "2025-03-27T18:30Z",
      "dateEnd": "2025-03-27T19:00Z",
      "title": "\"Move Fast and Build Things: A Non-Technical Guide to AI Agents\" by Eric Bye",
      "description": "Ever needed just one feature from an expensive subscription or waited weeks for a basic proof of concept? While AI agents may not live up to all the hype, they are genuinely transforming how quickly we can build and deploy software. In this talk, I'll demonstrate how to turn an idea into a working product in hours, outline a practical process to follow, highlight common pitfalls, and discuss the limitations. Whether you're a technical founder or simply have an idea, this session will show you how AI agents can help you build faster."
    },
    {
      "dateStart": "2025-03-27T19:00Z",
      "dateEnd": "2025-03-27T19:15Z",
      "title": "Break"
    },
    {
      "dateStart": "2025-03-27T19:15Z",
      "dateEnd": "2025-03-27T19:45Z",
      "title": "\"Dark side of the Moon\" by Rehan Butt",
      "description": "Developers often see the world of tech through the lens of code, frameworks, and innovation. But beyond the Git commits and pull requests lies a business reality that many don’t see—or worse, choose to ignore. \"Dark Side of the Moon\" is a candid look at what it truly takes to work in and run a tech business. Many developers assume that technical prowess alone guarantees success, but the hidden pitfalls of the industry tell a different story. From financial mismanagement and poor client relationships to the dangers of unchecked ego, this talk will expose the common mistakes that can derail careers and businesses alike. Whether you're a junior developer, a freelancer, or an experienced coder considering your own venture, this session will arm you with hard-earned lessons from two decades in the trenches. You’ll walk away with insights into how to navigate company politics, build sustainable client relationships, and avoid becoming the biggest obstacle to your own success. Because in tech, it’s not just about writing great code—it’s about knowing what not to do."
    }
  ],
  "speakers": ["eric-bye", "rehan-butt"]
}
