[
  {
    "id": 1,
    "title": "#1: PJ Evans & Junade Ali",
    "description": "We are thrilled to invite you to the inaugural event of our new series of events! Join us for an insightful talks, networking opportunities, and talks by very special guests. Save the date and be part of this community!",
    "location": "Vulcan Works, 34-38 Guildhall Rd, Northampton, NN1 1EW",
    "locationUrl": "https://vulcanworks.co.uk",
    "date": "2024-03-27T18:00Z",
    "price": "FREE",
    "ticketingSystemUrl": "TODO",
    "schedule": [
      {
        "time": "18:00 - 18:30",
        "talk": "\"Boiling Nemo\" by PJ Evans",
        "summary": "In the course of recent history fish have been relatively untroubled by the Internet of Things, but it’s time for that to change. Armed only with a soldering iron, some JavaScript and ideas above his station, PJ will show us how you can build a simple IoT device and how the whole enterprise can spiral out of control. Highlights include a Scottish toilet emergency, an aquarium featuring military-grade security and an extinction-level event in the suburbs of Milton Keynes."
      },
      {
        "time": "18:30 - 19:00",
        "talk": "Break"
      },
      {
        "time": "19:00 - 19:30",
        "talk": "\"The Science of Software Engineering\" by Junade Ali",
        "summary": "Over the past few years, Dr Junade Ali has studied the health of software engineering teams, with research covered in outlets including Forbes, The Register, ZDNet and ComputerWeekly. During this research, Dr Ali has assessed the real-world performance of engineering teams and interviewed thousands of people; including sampling software engineers, business decision-makers and consumers. Dr Ali’s work on developer burnout in 2021 and workplace retaliation in 2023 has been widely shared across the industry. This talk will present insights from investigations and studies into engineering teams."
      }
    ],
    "speakers": [
      {
        "name": "PJ Evans",
        "role": "Senior Engineer at Mindera",
        "image": "/pj.jpg",
        "urlLinkedIn": "https://www.linkedin.com/in/mrpjevans/",
        "urlMastodon": "https://mastodon.social/@mrpjevans"
      },
      {
        "name": "Dr Junade Ali CEng FIET",
        "role": "CEO at Engprax",
        "image": "/junade.jpg",
        "urlWebsite": "https://junade.com",
        "urlLinkedIn": "https://www.linkedin.com/in/junade/"
      }
    ]
  }
]
