{
  "id": 2,
  "name": "#2: \"Design Secrets for Developers\" by Thomas Reeve and \"Type-safe localization of Unsplash.com\" by Oliver Ash",
  "description": "Following the well-received inaugural event of our new series, we are excited to invite you to a second edition of NN1 Dev Club. This time, we will dive into practical design tactics with Thomas Reeve and secrets of type-safe localization of Unsplash.com with Oliver Ash. Save the date!",
  "dateStart": "2024-06-27T18:00Z",
  "dateEnd": "2024-06-27T20:00Z",
  "locationText": "Vulcan Works, 34-38 Guildhall Rd, Northampton, NN1 1EW",
  "locationUrl": "https://maps.app.goo.gl/q7RFeDME5cLZWPFA7",
  "ticketText": "FREE (Eventbrite registration required)",
  "ticketUrl": "https://www.eventbrite.co.uk/e/2-nn1-dev-club-tickets-880658502287",
  "parkingText": "St. John's Multi Storey Car Park",
  "parkingUrl": "https://maps.app.goo.gl/fk3jpaPLSLGrHNmH6",
  "schedule": [
    {
      "dateStart": "2024-06-27T18:00Z",
      "dateEnd": "2024-06-27T18:15Z",
      "title": "Meet and Greet"
    },
    {
      "dateStart": "2024-06-27T18:15Z",
      "dateEnd": "2024-06-27T18:30Z",
      "title": "Intro"
    },
    {
      "dateStart": "2024-06-27T18:30Z",
      "dateEnd": "2024-06-27T19:00Z",
      "title": "\"From Meh to Magic: Design Secrets for Developers\" by Thomas Reeve",
      "description": "Design is full of laws, principles and methodologies that only seem to confuse and bamboozle. Gestalt, double-diamond, skeuomorphism, heuristics, moiré. The list goes on. Sometimes it feels like you need a dictionary when talking to a designer. Join Tom, as he takes us through practical design tactics that you can apply to elevate your projects from functional to fantastic. Whether you're polishing UI elements or overhauling user experiences, you'll leave with insider knowledge you can start using tomorrow. Perfect for developers looking to add a dash of design to their toolkit."
    },
    {
      "dateStart": "2024-06-27T19:00Z",
      "dateEnd": "2024-06-27T19:15Z",
      "title": "Break"
    },
    {
      "dateStart": "2024-06-27T19:15Z",
      "dateEnd": "2024-06-27T19:45Z",
      "title": "\"Localizing Unsplash.com using types to enforce correct translations\" by Oliver Ash",
      "description": "There are many different tools and JavaScript libraries for internationalizing websites, but type safety is often an afterthought. This talk presents the unique approach taken by the web team at Unsplash—utilizing types to enforce correctness—including a look at intlc, a compiler which converts ICU Messages into TypeScript functions."
    }
  ],
  "guests": [
    {
      "image": "/2/thomasreeve.jpg",
      "name": "Thomas Reeve",
      "role": "Head of Design at Zyte",
      "bio": "Tom has spent the last 15+ years leading design for some of the country’s biggest brands. From ecommerce, to logistics, to education, to AI. Tom applies the same no-bullshit approach to design, making it work for users and the business.",
      "urlLinkedIn": "https://www.linkedin.com/in/thomas-reeve/"
    },
    {
      "image": "/2/oliverash.jpg",
      "name": "Oliver Ash",
      "role": "Head of Web at Unsplash",
      "bio": "Professionally fan of strictly typed languages, frontend development and functional programming. Part of the Unsplash.com web team for the last seven years. After work, a father of two kids, a dog owner and a keen runner from Rushden.",
      "urlTwitter": "https://twitter.com/OliverJAsh",
      "urlWebsite": "https://twitter.com/OliverJAsh"
    }
  ]
}
